Rhino.Input.Custom.GetTorus.VerticalDirectionMinimumCount
The minumum number of faces in the vertical direction.
Since: 7.0

Rhino.Input.Custom.GetTorus.AroundDirectionMinimumCount
The minumum number of faces in the around direction.
Since: 7.0