Rhino.Geometry.Centermark
Represents a center mark

Rhino.Geometry.Centermark.#ctor
Since: 6.0

Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)
Create a new center mark
dimStyle: Dimension's AnnotationStyle
plane: Dimension's plane
centerpoint: Dimension's center point
radius: Center mark's radius
Returns:
Since: 6.0