Rhino.Geometry.SquishParameters.Algorithm
The flattening agorithm to use:
Geometric: (scale independent)the "spring" constant is
proportional to 1/L^2 and the result is independent of scale.
PhysicalStress: (scale dependent) the "spring" constant is
proportional to 1/L.
Since: 7.9