Rhino.Geometry.Brep.CreatePlanarUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Plane,System.Double)
CreatePlanarUnion
breps: The planar regions on which to preform the union operation.
plane: The plane in which all the input breps lie
tolerance: Tolerance to use for union operation.
Returns: An array of Brep results or null on failure.
Since: 7.0

Rhino.Geometry.Brep.CreatePlanarIntersection(Rhino.Geometry.Brep,Rhino.Geometry.Brep,Rhino.Geometry.Plane,System.Double)
CreatePlanarIntersection
b0: The first brep to intersect.
b1: The first brep to intersect.
plane: The plane in which all the input breps lie
tolerance: Tolerance to use for intersection operation.
Returns: An array of Brep results or null on failure.
Since: 7.0

Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Joins the breps in the input array at any overlapping edges to form
as few as possible resulting breps. There may be more than one brep in the result array.
brepsToJoin: A list, an array or any enumerable set of breps to join.
tolerance: 3d distance tolerance for detecting overlapping edges.
Returns: new joined breps on success, null on failure.
Since: 5.0

Rhino.Geometry.Brep.MergeBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Combines two or more breps into one. A merge is like a boolean union that keeps the inside pieces. This
function creates non-manifold Breps which in general are unusual in Rhino. You may want to consider using
JoinBreps or CreateBooleanUnion functions instead.
brepsToMerge: must contain more than one Brep.
tolerance: the tolerance to use when merging.
Returns: Single merged Brep on success. Null on error.
Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Since: 5.0