Rhino.Geometry.SubDPatchStyle.QuadOrTriangleFan
If the hole boundary has an even mumber of edges, a quad fan is used.
Otherwise a triangle fan is used. The center of the fan
is the average of the hole boundary vertex control net points.