Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChildCallback
Called after content has been allocated and before it has been added
to the document.  Override this method when you need to call virtual
class methods that should not be called from the constructor.
Returns:
Return true to allow the content to be added to the document or false
if it should be destroyed.