Rhino.Runtime.CommonObject.UserDictionary
Dictionary of custom information attached to this class. The dictionary is actually user
data provided as an easy to use sharable set of information.
Since: 5.0