Rhino.DocObjects.ModelComponentType.RenderMaterial
Render material.

Rhino.DocObjects.ModelComponentType.Mixed
Multiple component types.
Used when a component type filter must include all explicit component types.