Rhino.Render.InternalUtilities.GenerateRendercontentPreview(Rhino.Render.LinearWorkflow,Rhino.Render.RenderContent,System.Int32,System.Int32,System.Boolean,Rhino.Render.PreviewJobSignature,Rhino.Render.PreviewAppearance,System.UInt32@)
Generate a render content preview
lwf: Linear Workflow
c: Render Content
width: Image width
heigth: Image heigth
bSuppressLocalMapping: Suppress Local Mapping
pjs: Preivew Job Signature
pa: Preivew Appearance
rValue: Reference to RCPResult value
Returns: The Bitmap of the render content preview

Rhino.Render.InternalUtilities.GenerateQuickContentPreview(Rhino.Render.RenderContent,System.Int32,System.Int32,Rhino.Render.PreviewSceneServer,System.Boolean,System.Int32,System.UInt32@)
Generate a quick render content preview
c: Render Content
width: Image width
heigth: Image heigth
psc: PreviewSceneServer
bSuppressLocalMapping: SuppressLocalMapping
reason:  ContentChanged = 0, ViewChanged = 1, RefreshDisplay = 2, Other = 99
rValue: bool value for successfull quick image creation
Returns: The Bitmap of the quick render content preview

Rhino.Render.InternalUtilities.GetInUseMarkerState(Rhino.Render.RenderContent,System.Collections.Generic.List{Rhino.Display.Color4f}@,System.Boolean@)
Get the In Use Marker state of content. Used by thumbnaillist to draw the corners and set selected color in UI
c: Render Content
colors: Selected color
bIsMarkedOut: True if content is in use, otherwise false