Rhino.Geometry.Squisher.SquishSurface(Rhino.Geometry.SquishParameters,Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.List{Rhino.Geometry.GeometryBase})
Squish the surface into a flat brep
sp: The parameters for the squish operation
surface: The surface to be squished
marks: Point, PountCloud, TextDot, and Curve objects to squish. Can be null.
squished_marks_out: A list of the squished marks, with null entires for marks
that fail to squish. Can be null.
Returns: A brep representing the flattened surface
Since: 7.9

Rhino.Geometry.Squisher.GetMesh2dEdges
Gets the edges of the mesh which correspond to the edges of the same indices resulting from GetMesh3dEdges
Returns: And array of lines representing the mesh edges
Since: 7.9

Rhino.Geometry.Squisher.GetMesh3dEdges
Gets the edges of the mesh which correspond to the edges of the same indices resulting from GetMesh2dEdges
Returns: And array of lines representing the mesh edges
Since: 7.9