Rhino.BitmapExtensions.BitmapAsTextureFileReference(System.Drawing.Bitmap,System.UInt32)
Inserts bitmap into Rhino's texure manager and returns a FileReference.
bitmap: The bitmap which will be referenced by the FileReference.
crc: The crc of the bitmap. This should be a unique number which changes if the contents of the bitmap changes.
NOTE: if a different bitmap is provided using the same crc as a previous bitmap, then the previous bitmap will be overwritten in the texture manager and both previously returned FileReferences will reference the newly provided bitmap.
Since: 7.7