Rhino.Collections.ArchivableDictionary.GetEnumerator
Gets the enumerator of this dictionary.
Returns: A System.Collections.Generic.IEnumerator`1, where T is an instance of System.Collections.Generic.KeyValuePair`2, with T0 set as string, and T1 as Syste.Object.
Since: 5.0

Rhino.Collections.ArchivableDictionary.System#Collections#IEnumerable#GetEnumerator
Gets the enumerator of this dictionary.
Returns: A System.Collections.Generic.IEnumerator`1, where T is an instance of System.Collections.Generic.KeyValuePair`2, with T0 set as string, and T1 as Syste.Object.
Since: 5.0