Rhino.UI.PanelInstance.CreateInstance(System.Guid,System.Type,System.UInt32)
Dynamically create an instance of the panelType and a managed host
as necessary.  If the object and host are created successfully than
a new PanelInstance is returned which can be used to reference the
panel object.
runtimeId:
The runtime Id for this panel
panelType:
The class type to create an instance of
documentSerailNumber:
This is not saved, it is simply used to pass to the panel class
constructor if the class has a constructor that takes  document serial
number
Returns:
If the panel and native host pointer were created then return a new
PanelInstance otherwise return null on error.