Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags)
Get the texture render CRC for the referenced texture using the TextureRenderHashFlags
given
Since: 7.0

Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags,Rhino.Render.LinearWorkflow)
Get the texture render CRC for the referenced texture using the TextureRenderHashFlags
given along with the LinearWorkflow
Since: 7.0

Rhino.Render.Decal.DecalMapping
Gets the mapping of the decal.
Since: 5.10

Rhino.Render.Decal.DecalProjection
Gets the decal's projection. Used only when mapping is planar.
Since: 5.10

Rhino.Render.Decal.StartLatitude
Gets the start angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
Since: 5.10

Rhino.Render.Decal.EndLatitude
Gets the end angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
Since: 5.10

Rhino.Render.Decal.StartLongitude
Gets the start angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
Since: 5.10

Rhino.Render.Decal.EndLongitude
Gets the end angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
Since: 5.10

Rhino.Render.Decal.CustomData
Gets custom data associated with this decal - see Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
Returns: The return value can be null if there is no data associated with this decal.
Since: 6.0