Rhino.Geometry.SubD.JoinSubDs(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubD},System.Double,System.Boolean)
Joins an enumeration of SubDs to form as few as possible resulting SubDs.
There may be more than one SubD in the result array.
subdsToJoin: An enumeration of SubDs to join.
tolerance: The join tolerance.
joinedEdgesAreCreases:
If true, merged boundary edges will be creases.
If false, merged boundary edges will be smooth.
Returns:
Remarks:
All of the input SubDs are copied and added to the result array in one form or another.
Since: 7.14

Rhino.Geometry.SubD.CreateFromSweep(Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.NurbsCurve},System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.Vector3d)
Fits a SubD through a series of profile curves that define the SubD cross-sections and one curve that defines a SubD edge.
rail1: A SubD-friendly NURBS curve to sweep along.
shapes: An enumeration of SubD-friendly NURBS curves to sweep through.
closed: Creates a SubD that is closed in the rail curve direction.
addCorners: With open curves, adds creased vertices to the SubD at both ends of the first and last curves.
roadlikeFrame:
Determines how sweep frame rotations are calculated.
If false (Freeform), frame are propogated based on a refrence direction taken from the rail curve curvature direction.
If true (Roadlike), frame rotations are calculated based on a vector supplied in "roadlikeNormal" and the world coordinate system.
roadlikeNormal:
If roadlikeFrame = true, provide 3D vector used to calculate the frame rotations for sweep shapes.
If roadlikeFrame = false, then pass Rhino.Geometry.Vector3d.Unset.
Returns: A new SubD if successful, or null on failure.
Remarks:
Shape curves must be in the proper order and orientation.
Shape curves must have the same point counts and rail curves must have the same point counts.
Shape curves will relocated to the nearest pair of Greville points on the rails.
Shape curves will be made at each pair of rail edit points where there isn't an input shape.
Since: 7.0

Rhino.Geometry.SubD.ClearEvaluationCache
Clear cached information that depends on the location of vertex control points
Since: 7.0

Rhino.Geometry.SubD.ComponentFromComponentIndex(Rhino.Geometry.ComponentIndex)
Returns a SubDComponent, eithere a SubDEdge, SubDFace, or SubDVertex, from a component index.
componentIndex: The component index.
Returns: The SubDComponent if successful, null otherwise.
Since: 7.6

Rhino.Geometry.SubD.Subdivide(System.Int32)
Apply the Catmull-Clark subdivision algorithm and save the results in
this SubD
count: Number of times to subdivide (must be greater than 0)
Returns: true on success
Since: 7.0

Rhino.Geometry.SubD.InterpolateSurfacePoints(Rhino.Geometry.Point3d[])
Modifies the SubD so that the SubD vertex limit surface points are
equal to surface_points[]
surfacePoints:
point for limit surface to interpolate. surface_points[i] is the
location for the i-th vertex returned by SubVertexIterator vit(this)
Returns:
Since: 7.1