Rhino.Render.SafeFrame
SafeFrame

Rhino.Render.SafeFrame.#ctor
Create an utility object not associated with any document
Since: 7.12

Rhino.Render.SafeFrame.#ctor(Rhino.Render.SafeFrame)
Create an utility object not associated with any document from another object
g:
Since: 7.12

Rhino.Render.SafeFrame.Enabled
Determines whether the safeframe is enabled.
Since: 7.12

Rhino.Render.SafeFrame.FieldsOn
Show a 4 by 3 grid in the safe-frame.
Since: 7.12

Rhino.Render.SafeFrame.ActionFrameXScale
Action Frame Scale X
Since: 7.12

Rhino.Render.SafeFrame.ActionFrameYScale
Action Frame Scale Y
Since: 7.12

Rhino.Render.SafeFrame.TitleFrameXScale
Title Frame Scale X
Since: 7.12

Rhino.Render.SafeFrame.TitleFrameYScale
Title Frame Scale Y
Since: 7.12