Rhino.Render.PostEffects.PostEffectPipeline.Execute(System.Drawing.Rectangle,System.Boolean,Rhino.Render.PostEffects.PostEffectExecuteContexts,Rhino.Render.PostEffects.PostEffectHistograms)
Execute the pipeline. This executes all the post effects in order.
Only this rectangle need be modified by the post effects.
p: p is a rectangle within the frame buffer.
renderingInProgress: rendering is true if rendering is in progress.
usageContexts: Context this pipeline is being executed in
histogramsToUpdate: Bitwise list of histograms to update during the execution of the pipeline
Returns:
Since: 7.0