Rhino.Render.LinearWorkflow.CopyFrom(Rhino.Render.FreeFloatingBase)
Create a copy of linearworkflow
src:
Since: 6.0

Rhino.Render.LinearWorkflow.#ctor
Create a utility object not associated with any document
Since: 6.0

Rhino.Render.LinearWorkflow.#ctor(Rhino.Render.LinearWorkflow)
Create a utility object not associated with any document from another object
src:
Since: 6.0

Rhino.Render.LinearWorkflow.PreProcessColors
Linear workflow active state
Since: 6.0

Rhino.Render.LinearWorkflow.PreProcessTextures
Linear workflow active state
Since: 6.0

Rhino.Render.LinearWorkflow.PostProcessFrameBuffer
Linear workflow active state
Since: 6.0

Rhino.Render.LinearWorkflow.PreProcessGamma
Linear workflow gamma
Since: 6.0

Rhino.Render.LinearWorkflow.PostProcessGamma
Linear workflow gamma
Since: 6.0

Rhino.Render.LinearWorkflow.PostProcessGammaOn
Linear workflow gamma
Since: 6.0

Rhino.Render.LinearWorkflow.PostProcessGammaReciprocal
Linear workflow gamma
Since: 6.0

Rhino.Render.LinearWorkflow.Hash
Linear workflow CRC
Since: 6.0

Rhino.Render.LinearWorkflow.Equals(System.Object)
Compare two LinearWorkflow objects. They are considered equal when
their Hashes match.
obj:
Returns: