Rhino.Geometry.Quaternion.GetRotation(Rhino.Geometry.Transform@)
Returns a transformation matrix that performs the rotation defined by the quaternion.
The transformation returned by this method has the property that xform * V = q.Rotate(V).
If the quaternion is not unitized, the rotation of its unitized form is returned.
xform:
Returns: true if successful, false otherise.
Remarks:
Do not confuse the result of this method the transformation matrix returned by Rhino.Geometry.Quaternion.MatrixForm.
Since: 7.12