Rhino.Render.GroundPlane.#ctor
Create an utility object not associated with any document
Since: 6.0

Rhino.Render.GroundPlane.#ctor(Rhino.Render.GroundPlane)
Create an utility object not associated with any document from another object
g:
Since: 6.0

Rhino.Render.GroundPlane.Altitude
Height above world XY plane in model units.
Since: 5.0