Rhino.Geometry.OrdinateDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Initialize Dimension parameters
dimStyle: Dimension's AnnotationStyle
plane: Dimension;s plane
direction: MeasuredDirection.XAxis or MeasuredDirection.YAxis
basepoint: Dimension's base point
defpoint: Dimension's definition point
leaderpoint: Point at tail of leader
kinkoffset1: Distance to first jog
kinkoffset2: Distance to second jog
Returns:
Since: 6.0