Rhino.FileIO.FileObjReadOptions.UseObjObjects
Determines whether or not "o"s in the obj file
will be interpreted as objects in the Rhino model
Remarks:
If UseObjGsAs is OBJGroupsAsObjects this value is ignored.
Since: 6.0