Rhino.Collections.Point3dList.Equals(System.Object)
Overrides the dafault object equality to compare lists by value.
obj:
Returns: True is objects are exaclty equal in value.

Rhino.Collections.Point3dList.Equals(Rhino.Collections.Point3dList)
Determines if the point lists are exactly equal.
other:
Returns: True is objects are exaclty equal in value.
Since: 7.1