Rhino.Render.RenderContent.ConvertConentKind(UnsafeNativeMethods.CRhRdkContentKindConst)
Convert unmanaged UnsafeNativeMethods.CRhRdkContentKindConst to managed
RenderContentKind.
kind:
Returns:

Rhino.Render.RenderContent.#ctor
internal because we don't want people to ever directly subclass RenderContent.
They should always derive from the subclasses of this class

Rhino.Render.RenderContent.TypeName
Name for your content type.  ie. "My .net Texture"
Since: 5.1

Rhino.Render.RenderContent.TypeDescription
Description for your content type.  ie.  "Procedural checker pattern"
Since: 5.1

Rhino.Render.RenderContent.ForDisplay
The only place a single proxy can be displayed is in the
New Content Control main thumbnail. All other attempts to
use a single proxy in a UI require it to be replaced with
the corresponding multi proxy. Single proxies override this
to find the corresponding multi proxy.
Returns: The cotnent.
Since: 6.9

Rhino.Render.RenderContent.SetRenderHash(System.UInt32)
This method is deprecated and no longer called. For more information
see Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)
hash:
Since: 6.0
6.0

Rhino.Render.RenderContent.IsRenderHashCached
This method is deprecated and no longer called. For more information
see Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)
Returns: bool
Since: 6.0
6.0

Rhino.Render.RenderContent.RenderHash
Render hash for the content hierarchy. It iterates children and includes
a caching mechanism which means the hash value can be retrieved quickly
if it hasn't changed. The cache is invalidated when Changed() is called.
You can override the Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64) method to provide
a custom hash value.
Since: 6.0

Rhino.Render.RenderContent.SetIsRenderHashRecursive(System.Boolean)
By default, RenderHash() recurses into children when computing the render CRC.
However, some applications may require children to be excluded from the render CRC calculation.
Call this method to enable or disable recursing into children.
see Rhino.Render.RenderContent.RenderHash
recursive:
Since: 7.0

Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.TextureRenderHashFlags,System.String)
As RenderHash, but ignore parameter names given.
flags: Flags to ignore
excludeParameterNames: semicolon-delimited string
Returns: Render hash
Since: 6.0

Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.CrcRenderHashFlags,System.String)
As RenderHash, but ignore parameter names given.
flags: Flags to ignore
excludeParameterNames: semicolon-delimited string
Returns: Render hash
Since: 6.2

Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.CrcRenderHashFlags,System.String,Rhino.Render.LinearWorkflow)
As RenderHash, but ignore parameter names given.
Use this version of the function to calculate a render hash when you have the linear workflow information and you
are not running on the main thread.  Access to LinearWorkflow data requires document access.
CrcRenderHashFlags.ExcludeLinearWorkflow must be specified.
flags: Flags to ignore
excludeParameterNames: semicolon-delimited string
lw: Linear Workflow to use for CRC
Returns: Render hash
Since: 6.2

Rhino.Render.RenderContent.FirstChild
Return First child of this content or nullptr if none.
Since: 6.0

Rhino.Render.RenderContent.NextSibling
Return First sibling of this content or nullptr if none.
Since: 6.0

Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection@)
Since: 7.0

Rhino.Render.RenderContent.SetChild(Rhino.Render.RenderContent,System.String)
Set another content as a child of this content. This content may or may
not be attached to a document.  If this content already has a child
with the specified child slot name, that child will be deleted.  If
this content is not attached to a document, the child will be added
without sending any events.  If this content is attached to a document,
the necessary events will be sent to update the UI.
Note:
Do not call this method to add children in your constructor. If you
want to add default children, you should override Initialize() and add
them there.
renderContent:
Child content to add to this content. If pChild is NULL, the function
will fail.  If pChild is already attached to a document, the function
will fail.  If pChild is already a child of this or another content,
the function will fail.
childSlotName:
The name that will be assigned to this child slot. The child slot name
cannot be an empty string. If it is, the function will fail.
Returns:
Returns true if the content was added or the child slot with this name
was modified otherwise; returns false.
Since: 6.0

Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(System.Guid,System.String,System.String)
Override this method to restrict the type of acceptable child content.
The default implementation of this method just returns true.
kindId:
factoryKind:
childSlotName:
Returns:
Return true only if content with the specified kindId can be  accepted
as a child in the specified child slot.
Since: 5.11

Rhino.Render.RenderContent.CurrentEnvironmentChanged
Event fired when changes to current environments have been made.
This will be one of Background, ReflectionAndRefraction or Skylighting
Since 6.11
Since: 6.11