Rhino.Render.RenderMaterial.SimulateMaterial(Rhino.DocObjects.Material@,System.Boolean)
Override this function to provide a Rhino.DocObjects.Material definition for this material
to be used by other rendering engines including the display.
simulation: Set the properties of the input basic material to provide the simulation for this material.
isForDataOnly: Called when only asking for a hash - don't write any textures to the disk - just provide the filenames they will get.
[Obsolete("SimulatedMaterial with TextureGeneration instead, and don't override this virtual function")]
Since: 5.1

Rhino.Render.RenderMaterial.SimulatedMaterial(Rhino.Render.RenderTexture.TextureGeneration)
Since: 7.0