Rhino.DocObjects.Layer.IsVisible
Gets or sets the visibility of this layer.
Since: 5.0

Rhino.DocObjects.Layer.GetPersistentVisibility
The persistent viability setting is used for layers whose visibility can
be changed by a "parent" object. A common case is when a layer is a
child layer (ParentId is not nil). In this case, when a parent layer is
turned off, then child layers are also turned off. The persistent
visibility setting determines what happens when the parent is turned on
again.
Remarks:
Returns true if this layer's visibility is controlled by a parent
object and the parent is turned on (after being off), then this
layer will also be turned on.
Returns false if this layer's visibility is controlled by a parent
object and the parent layer is turned on (after being off), then
this layer will continue to be off.
When the persistent viability is not explicitly set, this
property returns the current value of IsVisible
Since: 5.5

Rhino.DocObjects.Layer.SetPersistentVisibility(System.Boolean)
Set the persistent visibility setting for this layer
persistentVisibility:
Since: 5.5

Rhino.DocObjects.Layer.IsValidName(System.String)
Determines if a given string is valid for a layer name.
name: A name to be validated.
Returns: true if the name is valid for a layer name; otherwise, false.
Since: 5.0

Rhino.DocObjects.Layer.GetChildren
Gets immediate children of this layer. Note that child layers may have their own children.
Returns: Array of child layers. null if this layer does not have any children.
Since: 5.0