Rhino.DocObjects.ObjectEnumeratorSettings.VisibleFilter
The default object enumerator settings ignore the visiblity state of objects.
If you want the iterator to limit itself to visible objects, then set this property to true.
Since: 5.0