Rhino.Render.Fields.FieldDictionary
Dictionary containing RenderContent data fields. Add fields to this
dictionary in your derived RenderContent classes constructor. Get field
values using the TryGet[data type]() methods and set them using the Set()
method.
[System.Runtime.InteropServices.Guid("ABE4059B-9BD7-451C-91B2-67C2F188860A")]
public class CustomMaterial : RenderMaterial
{
public override string TypeName { get { return "CSharp Custom Material"; } }
public override string TypeDescription { get { return "My first custom .NET material"; } }
public CustomMaterial()
{
Fields.AddField("bool", false, "Yes/No");
Fields.AddField("color", Rhino.Display.Color4f.White, "Color");
}
}
Important note about field names prior to Rhino 8
-------------------------------------------------
When adding fields to the dictionary, the key name for the field appears directly in the XML tag
stored in the 3dm file. Therefore, this string must be a valid XML tag. We use a simplified form of
validation where the key must start with a letter or underscore, and continue with only letters, digits,
underscores, periods or hyphens.
The tag syntax is formally expressed in EBNF notation as follows:
NameChar ::=  Letter | Digit | '.' | '-' | '_'
Name     ::= (Letter | '_') (NameChar)*
where 'Letter' means any ASCII letter; 'a' to 'z' or 'A' to 'Z' and 'Digit' means any ASCII digit '0' to '9'.