Rhino.Geometry.AngularDimension.#ctor
Since: 6.0

Rhino.Geometry.AngularDimension.#ctor(Rhino.Geometry.Arc,System.Double)
Create an angular dimension from a given arc
arc: The start and end points of the arc are the start and endpoints of the dimension
offset: How far to offset the dimension location from the arc
Since: 5.0

Rhino.Geometry.AngularDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
dimStyle: Dimension's DimensionStyle
plane: Dimension's Plane
horizontal: Horizontal reference direction
centerpoint: Dimension center point
defpoint1: First definition point
defpoint2: Second definition point
dimlinepoint: Point on dimension line
Returns:
Since: 6.0

Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Update Dimension geometry from point locations
plane: Dimension's plane
centerpoint: Dimension's center point
defpoint1: First definition point
defpoint2: Second definition point
dimlinepoint: Point on dimension line
Returns:
Since: 6.0

Rhino.Geometry.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
styleId: Dimension's AnnotationStyle
plane: Dimension's plane
extpoint1: First dimension point
extpoint2: Second definition point
dirpoint1: First direction point
dirpoint2: Second direction point
dimlinepoint: Point on dimension line
Returns:
Since: 6.0

Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Update Dimension geometry from point locations
plane: Dimension's plane
extpoint1: First dimension point
extpoint2: Second definition point
dirpoint1: First direction point
dirpoint2: Second direction point
dimlinepoint: Point on dimension line
Returns:
Since: 6.0