Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
crossSection: Shape curve
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)
Since: 5.0
7.0

Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
crossSections: Shape curves
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double})
Since: 5.0
7.0

Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
crossSection: Shape curve
refitTolerance: Refit tolerance
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
Since: 5.0
7.0

Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
crossSections: Shape curves
refitTolerance: Refit tolerance
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)
Since: 5.0
7.0

Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
crossSection: Shape curve
rebuildCount: Rebuild point count
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)
Since: 5.0
7.0

Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
crossSections: Shape curves
rebuildCount: Rebuild point count
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)
Since: 5.0
7.0