Rhino.Geometry.TextEntity.CreateCurves(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Returns the outline curves.
dimstyle:
bAllowOpen:  Set to true to prevent forced closing of open curves retrieved from glyphs.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of curves that forms the outline or content of this text entity.
Since: 6.0