Rhino.Geometry.SubDVertex.ControlNetPoint
Location of the "control net" point that this SubDVertex represents
Since: 7.0

Rhino.Geometry.SubDVertex.SurfacePoint
The SubD surface point
Returns:
Since: 7.1