Rhino.Input.Custom.GetEllipsoid
Class provides user interface to define a truncated cone.

Rhino.Input.Custom.GetEllipsoid.Get(Rhino.Geometry.NurbsSurface@)
Prompt for the getting of a ellipsoid.
ellipsoid: The truncated cone in NURB form.
Returns: The result of the getting operation.
Since: 7.0