Rhino.RhinoDoc.GetRenderPrimitives(System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:
Since: 6.0

Rhino.RhinoDoc.GetRenderPrimitives(Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
viewport:
The rendering view camera.
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:
Since: 6.0

Rhino.RhinoDoc.GetRenderPrimitives(System.Guid,Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
plugInId:
The Id of the plug-in creating the iterator.
viewport:
The rendering view camera.
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:
Since: 6.0

Rhino.RhinoDoc.GroundPlane
Gets the ground plane of this document.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.
Since: 5.0

Rhino.RhinoDoc.InGetPoint
Returns true if currently in a GetPoint.Get(), GetObject.GetObjects(), or GetString.Get()

Rhino.RhinoDoc.ExtractPreviewImage(System.String)
Extracts the bitmap preview image from the specified model (3DM).
The model (3DM) from which to extract the preview image.
If null, the currently loaded model is used.
Returns: true on success.
Since: 5.0

Rhino.RhinoDoc.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Determines if custom render meshes will be built for this document (i.e. - GH meshes).
viewport: The viewport being rendered.
attrs:
Type of mesh to build. If attrs is non-null then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this document.
Since: 6.9

Rhino.RhinoDoc.GetRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Build custom render mesh(es) for this document (i.e. - GH meshes).
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
Returns:
Returns a RenderPrimitiveList if successful otherwise returns null.
Since: 6.9

Rhino.RhinoDoc.TryGetRenderPrimitiveBoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes,Rhino.Geometry.BoundingBox@)
Get the bounding box for the custom render meshes associated with this
document (i.e. - GH meshes).
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
boundingBox:
This will be set to BoundingBox.Unset on failure otherwise it will be
the bounding box for the custom render meshes associated with this
object.
Returns:
Returns true if the bounding box was successfully calculated otherwise
returns false on error.
Since: 6.9