Rhino.UI.ToolbarFile.Id
Since: 5.0

Rhino.UI.ToolbarFile.Path
Full path to this file on disk
Since: 5.0

Rhino.UI.ToolbarFile.Name
Since: 5.0

Rhino.UI.ToolbarFile.Close(System.Boolean)
Since: 5.0

Rhino.UI.ToolbarFile.Save
Since: 5.0

Rhino.UI.ToolbarFile.SaveAs(System.String)
Since: 5.0

Rhino.UI.ToolbarFile.GroupCount
Since: 5.0

Rhino.UI.ToolbarFile.ToolbarCount
Since: 5.0

Rhino.UI.ToolbarFile.GetToolbar(System.Int32)
Since: 5.0

Rhino.UI.ToolbarFile.GetGroup(System.Int32)
Since: 5.0

Rhino.UI.ToolbarFile.GetGroup(System.String)
Since: 5.0