Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption
Specifies how texture coordinate information is transfered from the mesh to the SubD.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.None
No texture coordianate information is transfered from the mesh.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.Packed
No texture coordianate information is transfered from the mesh.
The SubD faces are packed.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.CopyCoordinates
If a mesh has custom texture coordinates, the custom texture coordinates
are transfered to the SubD. This requires more memory resources,
slows subdivision evaluation, often produces unattractive
results on n-gons, and distorts the texture when comes from a common mapping
technique, like planar. This option may be useful when the mesh contains only
triangles and quads and the custom texture coordinates are of high quality.