Rhino.DocObjects.Tables.ViewTable.GetViewList(System.Boolean,System.Boolean)
Gets an array of all the views.
includeStandardViews: true if "Right", "Perspective", etc., view should be included; false otherwise.
includePageViews: true if page-related views should be included; false otherwise.
Returns: A array of Rhino views. This array can be empty, but not null.
Since: 5.0