Rhino.Geometry.PlaneSurface
Represents a plane surface, with plane and two intervals.

Rhino.Geometry.PlaneSurface.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Initializes a plane surface with x and y intervals.
plane: The plane.
xExtents: The x interval of the plane that defines the rectangle.
The corresponding evaluation interval domain is set so that it matches the
extents interval.
yExtents: The y interval of the plane that defines the rectangle.
The corresponding evaluation interval domain is set so that it matches the
extents interval.
Since: 5.0

Rhino.Geometry.PlaneSurface.CreateThroughBox(Rhino.Geometry.Line,Rhino.Geometry.Vector3d,Rhino.Geometry.BoundingBox)
Makes a plane that includes a line and a vector and goes through a bounding box.
lineInPlane: A line that will lie on the plane.
vectorInPlane: A vector the direction of which will be in plane.
box: A box to cut through.
Returns: A new plane surface on success, or null on error.
Since: 5.0

Rhino.Geometry.PlaneSurface.CreateThroughBox(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Extends a plane into a plane surface so that the latter goes through a bounding box.
plane: An original plane value.
box: A box to use for extension boundary.
Returns: A new plane surface on success, or null on error.
Since: 5.0