Rhino.Geometry.RTree.Search(Rhino.Geometry.BoundingBox,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
box: A bounding box.
callback: An event handler to be raised when items are found.
Returns:
true if entire tree was searched. It is possible no results were found.
Since: 5.0

Rhino.Geometry.RTree.Search(Rhino.Geometry.BoundingBox,System.EventHandler{Rhino.Geometry.RTreeEventArgs},System.Object)
Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
box: A bounding box.
callback: An event handler to be raised when items are found.
tag: State to be passed inside the Rhino.Geometry.RTreeEventArgs Tag property.
Returns:
true if entire tree was searched. It is possible no results were found.
Since: 5.0

Rhino.Geometry.RTree.Search(Rhino.Geometry.Sphere,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches for items in a sphere.
sphere: bounds used for searching.
callback: An event handler to be raised when items are found.
Returns:
true if entire tree was searched. It is possible no results were found.
Since: 5.0

Rhino.Geometry.RTree.Search(Rhino.Geometry.Sphere,System.EventHandler{Rhino.Geometry.RTreeEventArgs},System.Object)
Searches for items in a sphere.
sphere: bounds used for searching.
callback: An event handler to be raised when items are found.
tag: State to be passed inside the Rhino.Geometry.RTreeEventArgs Tag property.
Returns:
true if entire tree was searched. It is possible no results were found.
Since: 5.0

Rhino.Geometry.RTree.SearchOverlaps(Rhino.Geometry.RTree,Rhino.Geometry.RTree,System.Double,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches two R-trees for all pairs elements whose bounding boxes overlap.
treeA: A first tree.
treeB: A second tree.
tolerance:
If the distance between a pair of bounding boxes is less than tolerance,
then callback is called.
callback: A callback event handler.
Returns:
true if entire tree was searched.  It is possible no results were found.
Since: 5.0