Rhino.Geometry.Point2f.DistanceTo(Rhino.Geometry.Point2f)
Computes the distance between two points.
other: Other point for distance measurement.
Returns: The length of the line between this and the other point; or 0 if any of the points is not valid.
Since: 5.0