Rhino.Render.RenderSettings.#ctor(Rhino.Render.RenderSettings)
Initialize new instance of the RenderSettings class.
source: If not null, settings are copied from source
Since: 6.0

Rhino.Render.RenderSettings.LinearWorkflow
Get the document linear workflow interface
Since: 6.0

Rhino.Render.RenderSettings.Dithering
Get the document dithering interface
Since: 6.0

Rhino.Render.RenderSettings.RenderChannels
Get the document render channels interface
Since: 7.0