Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.CurveKnotStyle)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate. For periodic curves if the final point is a
duplicate of the initial point it is  ignored. (Count must be >=2)
knots:
Knot-style to use  and specifies if the curve should be periodic.
Returns: interpolated curve on success. null on failure.
Since: 5.0

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.CurveKnotStyle,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate. For periodic curves if the final point is a
duplicate of the initial point it is  ignored. (Count must be >=2)
knots:
Knot-style to use  and specifies if the curve should be periodic.
startTangent: A starting tangent.
endTangent: An ending tangent.
Returns: interpolated curve on success. null on failure.
Since: 5.0

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Joins a collection of curve segments together.
inputCurves: Curve segments to join.
Returns: An array of curves which contains.
Since: 5.0

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Joins a collection of curve segments together.
inputCurves: An array, a list or any enumerable set of curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
Returns: An array of joint curves. This array can be empty.
Throws System.ArgumentNullException: If inputCurves is null.
Since: 5.0

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double,System.Boolean)
Joins a collection of curve segments together.
inputCurves: An array, a list or any enumerable set of curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
preserveDirection:
If true, curve endpoints will be compared to curve start points.
If false, all start and endpoints will be compared and copies of input curves may be reversed in output.
Returns: An array of joint curves. This array can be empty.
Throws System.ArgumentNullException: If inputCurves is null.
Since: 5.0

Rhino.Geometry.Curve.CreateMatchCurve(Rhino.Geometry.Curve,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.Curve,System.Boolean,Rhino.Geometry.PreserveEnd,System.Boolean)
Changes a curve end to meet a specified curve with a specified continuity.
curve0: The open curve to change.
reverse0: Reverse the directon of the curve to change before matching.
continuity: The continuity at the curve end.
curve1: The open curve to match.
reverse1: Reverse the directon of the curve to match before matching.
preserve: Prevent modification of the curvature at the end opposite the match for curves with fewer than six control points.
average: Adjust both curves to match each other.
Returns: The results of the curve matching, if successful, otherwise an empty array.
Since: 7.6

Rhino.Geometry.Curve.CreateTextOutlines(System.String,System.String,System.Double,System.Int32,System.Boolean,Rhino.Geometry.Plane,System.Double,System.Double)
Creates outline curves created from a text string. The functionality is similar to what you find in Rhino's TextObject command or TextEntity.Explode() in RhinoCommon.
text: The text from which to create outline curves.
font: The text font.
textHeight: The text height.
textStyle: The font style. The font style can be any number of the following: 0 - Normal, 1 - Bold, 2 - Italic
closeLoops: Set this value to True when dealing with normal fonts and when you expect closed loops. You may want to set this to False when specifying a single-stroke font where you don't want closed loops.
plane: The plane on which the outline curves will lie.
smallCapsScale: Displays lower-case letters as small caps. Set the relative text size to a percentage of the normal text.
tolerance: The tolerance for the operation.
Returns: An array containing one or more curves if successful.
Since: 6.0

Rhino.Geometry.Curve.DuplicateSegments
Duplicates curve segments.
Explodes polylines, polycurves and G1 discontinuous NURBS curves.
Single segment curves, such as lines, arcs, unkinked NURBS curves, are duplicated.
Returns:
An array of all the segments that make up this curve.
Since: 5.0

Rhino.Geometry.Curve.IsSubDFriendly
Returns true if the curve is a cubic, non-rational, uniform NURBS curve that is either periodic or has natural end conditions.
Othewise, false is returned.
Remarks:
A "natural" spline has zero 2nd derivatives (and hence zero curvature) at the start and end.
A "periodic" spline has unclampled periodic knots and periodic control points.
Since: 7.0

Rhino.Geometry.Curve.TorsionAt(System.Double)
Evaluate the torsion of a curve at a parmeter. Sometimes also called the "second curvature",
torsion is the rate of change of a curve's osculating plane.
t: The evaluation parameter.
Returns: The torsion if successful.
Remarks: See Barrett O'Neill, Elementary Differential Geometry, page 69.
Since: 7.10

Rhino.Geometry.Curve.OffsetNormalToSurface(Rhino.Geometry.Surface,System.Double)
Finds a curve by offsetting an existing curve normal to a surface.
The caller is responsible for ensuring that the curve lies on the input surface.
surface: Surface from which normals are calculated.
height: offset distance (distance from surface to result curve)
Returns:
Offset curve at distance height from the surface.  The offset curve is
interpolated through a small number of points so if the surface is irregular
or complicated, the result will not be a very accurate offset.
Since: 5.0