Rhino.Geometry.Torus.ToNurbsSurface
Converts this torus to its NURBS surface representation.
This is synonymous with calling NurbsSurface.CreateFromTorus().
Returns: A NURBS surface representation of this torus, or null on error.
Since: 5.0

Rhino.Geometry.Torus.ToRevSurface
Convert this torus to a surface of revolution representation.
This is synonymous with calling RevSurface.CreateFromTorus().
Returns: A surface of revolution representation of this torus, or null on error.
Since: 5.0