Rhino.Render.ContentList`1.FindInstance(System.Guid,System.Boolean)
Finds a content by its instance id.
instanceId: Instance id of the content to find.
includeChildren: Specifies if children should be searched as well as top-level content.
Returns: The found content or null.