Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)
edge:
knots:
tolerance:
bSections:
fitQuality:
Returns:
Since: 7.0