Rhino.Geometry.Transform.GetQuaternion(Rhino.Geometry.Quaternion@)
If this transform is a proper rotation, then find the eqivalent quaternion.
quaternion: Quaternion that represents this rotation tranformation.
Returns: true if this transform is a proper rotation, false otherwise.
Since: 7.12

Rhino.Geometry.Transform.ToFloatArray(System.Boolean)
Return the matrix as a linear array of 16 float values
rowDominant:
Returns:
Since: 5.9