Rhino.Geometry.Intersect.Intersection.LineLine(Rhino.Geometry.Line,Rhino.Geometry.Line,System.Double@,System.Double@)
Finds the closest point between two infinite lines.
lineA: First line.
lineB: Second line.
a:
Parameter on lineA that is closest to lineB.
The shortest distance between the lines is the chord from lineA.PointAt(a) to lineB.PointAt(b)
b:
Parameter on lineB that is closest to lineA.
The shortest distance between the lines is the chord from lineA.PointAt(a) to lineB.PointAt(b)
Returns:
true if points are found and false if the lines are numerically parallel.
Numerically parallel means the 2x2 matrix:
+AoA  -AoB
-AoB  +BoB
is numerically singular, where A = (lineA.To - lineA.From) and B = (lineB.To-lineB.From)
Since: 5.0

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,Rhino.Geometry.Plane)
Intersects a mesh with an (infinite) plane.
mesh: Mesh to intersect.
plane: Plane to intersect with.
Returns: An array of polylines describing the intersection loops or null (Nothing in Visual Basic) if no intersections could be found.
Since: 5.0

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.Plane})
Intersects a mesh with a collection of (infinite) planes.
mesh: Mesh to intersect.
planes: Planes to intersect with.
Returns: An array of polylines describing the intersection loops or null (Nothing in Visual Basic) if no intersections could be found.
Throws System.ArgumentNullException: If planes is null.
Since: 5.0

Rhino.Geometry.Intersect.Intersection.UseNewMeshIntersections
Instructs Rhino to provide the new mesh-mesh intersector implementation. This affects also MeshSplit and other commands.

Rhino.Geometry.Intersect.Intersection.GetSet_MX_DebugOptions(System.Int32,System.Boolean,System.Boolean)
Mofify an internal debug mechanism. Talk to Giulio regarding this.

Rhino.Geometry.Intersect.Intersection.PrintMeshIntersectionErrors
Instructs Rhino to print way way too much information regarding intersections.