Rhino.DocObjects.Tables.InstanceDefinitionTable.DestroySourceArchive(Rhino.DocObjects.InstanceDefinition,System.Boolean)
Destroys all source archive information.
Specifically:
* Rhino.DocObjects.InstanceDefinition.SourceArchive is set to the empty string.
* SourceRelativePath is set to false
* The alternative source archive path is set to the empty string.
* Checksum.Zero() is used to private destroy all checksum information.
* Rhino.DocObjects.InstanceDefinition.UpdateType is set to Rhino.DocObjects.InstanceDefinitionUpdateType.Static.
definition: The instance definition to be modified.
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
Returns true if the definition was successfully modified otherwise returns false.
Since: 6.0