Rhino.Render.Sun.#ctor
Create a non-document controlled Sun
Since: 5.0

Rhino.Render.Sun.ManualControl
Set angles directly or use place/date/time
Since: 5.10

Rhino.Render.Sun.DaylightSaving
Daylight savings time
Since: 5.10

Rhino.Render.Sun.DaylightSavingMinutes
Daylight saving minutes
Since: 6.0

Rhino.Render.Sun.TimeZone
Measured in hours += UTC
Since: 5.10

Rhino.Render.Sun.North
Angle in degrees on world X-Y plane that should be considered north in the model. Angle is
measured starting at X-Axis and travels counterclockwise. Y-Axis would be a north angle of 90
degrees.
Since: 5.0

Rhino.Render.Sun.Light
Get a Light which represents the sun. If manual control is in effect, no sun calculation
is performed; the function uses the values last used in calls to Azimuth, Altitude
or Vector. If manual control is not in effect, the observer's position, date, time,
time zone and daylight saving values are used to calculate the position of the sun.
Since: 6.0

Rhino.Render.Sun.SetPosition(System.Double,System.Double)
Sets position of the Sun based on azimuth and altitude values.
Using this function will also set sun to manual.
azimuthDegrees: The azimuth sun angle in degrees.
altitudeDegrees: The altitude sun angle in degrees.
Since: 5.0

Rhino.Render.Sun.SetPosition(System.DateTime,System.Double,System.Double)
Sets position of the sun based on physical location and time.
when: A System.DateTime instance.
If the date Kind is DateTimeKind.Local,
or DateTimeKind.Unspecified, the date is considered local.
latitudeDegrees: The latitude, in degrees, of the location on Earth.
longitudeDegrees: The longitude, in degrees, of the location on Earth.
Since: 5.0

Rhino.Render.Sun.Azimuth
Get the azimuth for the sun. To set use SetPosition(azimuth, altitude)
Since: 5.0

Rhino.Render.Sun.Altitude
Get the altitude for the sun. To set use SetPosition(azimuth, altitude)
Since: 5.0

Rhino.Render.Sun.Latitude
Since: 5.0

Rhino.Render.Sun.Longitude
Since: 5.0

Rhino.Render.Sun.GetDateTime(System.DateTimeKind)
Since: 5.0

Rhino.Render.Sun.SetDateTime(System.DateTime,System.DateTimeKind)
Since: 6.0

Rhino.Render.Sun.ShowDialog
Show the tabbed sun dialog.
Since: 5.0
6.0

Rhino.Render.Sun.ShowDialogEx
Helper function for Rhino.UI.Dialogs.ShowSunDialog(Sun) to show
the tabbed sun dialog.
Returns:
Returns true if the user clicked OK, or false if the user cancelled.