Rhino.Geometry.NurbsSurface.CreateFromPlane(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Int32,System.Int32,System.Int32,System.Int32)
Creates a NURBS surface from a plane and additonal parameters.
plane: The plane.
uInterval: The interval describing the extends of the output surface in the U direction.
vInterval: The interval describing the extends of the output surface in the V direction.
uDegree: The degree of the output surface in the U direction.
vDegree: The degree of the output surface in the V direction.
uPointCount: The number of control points of the output surface in the U direction.
vPointCount: The number of control points of the output surface in the V direction.
Returns: A NURBS surface if successful, or null on failure.
Since: 7.0