Rhino.Render.Skylight.#ctor
Create an utility object not associated with any document
Since: 6.0

Rhino.Render.Skylight.#ctor(Rhino.Render.Skylight)
Create an utility object not associated with any document from another object
src:
Since: 6.0

Rhino.Render.Skylight.ShadowIntensity
Since: 6.0

Rhino.Render.Skylight.CustomEnvironmentOn
Since: 6.0

Rhino.Render.Skylight.CustomEnvironment
Since: 6.0