Rhino.Render.DocumentOrFreeFloatingBase.BeginChange(Rhino.Render.RenderContent.ChangeContexts)
Call this function before making any change to this object (calling a setter) otherwise undo will not work correctly.  Calls to BeginChange must be paired with a call to EndChange.
cc: Change context
Since: 6.0

Rhino.Render.DocumentOrFreeFloatingBase.EndChange
See BeginChange
Returns: true if the object has returned to no-changes mode.
Since: 6.0