Rhino.Render.RenderWindow.GetAdjust
Get an ImageAdjust instance containing current image adjusting settings
for this RenderWindow
Returns: ImageAdjust
Since: 6.0
7.0

Rhino.Render.RenderWindow.SetAdjust(Rhino.Render.RenderWindow.ImageAdjust)
Set new ImageAdjust to use. An ImageAdjust instance can be obtained by first
querying for one using GetAdjust()
imageAdjust: ImageAdjust
Since: 6.0
7.0