Rhino.Geometry.Sphere.FitSphereToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Attempts to fit a sphere to a collection of points.
points: Points to fit. The collection must contain at least two points.
Returns: The Sphere that best approximates the points or Sphere.Unset on failure.
Since: 5.0