Rhino.Runtime.InteropWrappers.StdVectorFloat.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.

Rhino.Runtime.InteropWrappers.StdVectorFloat.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.

Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorFloat class.

Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor(Rhino.Runtime.InteropWrappers.StdVectorFloat)
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorFloat with the contents of another SimpleArrayFloat.

Rhino.Runtime.InteropWrappers.StdVectorFloat.CopyTo(Rhino.Runtime.InteropWrappers.StdVectorFloat)
Copies the contents of a Rhino.Runtime.InteropWrappers.StdVectorFloat into another SimpleArrayFloat.

Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor(System.Collections.Generic.IEnumerable{System.Single})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayFloat class
values: initial set of integers to add to the array

Rhino.Runtime.InteropWrappers.StdVectorFloat.Count
Gets the amount of elements in this array.

Rhino.Runtime.InteropWrappers.StdVectorFloat.Memory
Return the raw data.

Rhino.Runtime.InteropWrappers.StdVectorFloat.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.StdVectorFloat.Dispose
Actively reclaims unmanaged resources that this instance uses.