Rhino.Render.ChangeQueue.Mesh.GetMeshes
Get a SimpleArrayMeshPointer containing all meshes for the related Mesh
Returns:
Since: 6.0

Rhino.Render.ChangeQueue.Mesh.Mapping
Get the mapping for this mesh.
Since: 6.0