Rhino.Render.CurrentEnvironmentImpl.ForBackground
Get or set the RenderEnvironment used as 360deg background.
Null will be returned if the background environment isn't on.
To unset current background environment pass in null. Setting to a valid environment will also
turn the environment for this specific usage on.

Rhino.Render.CurrentEnvironmentImpl.ForLighting
Get or set the RenderEnvironment used as custom skylight environment.
Null will be returned if the custom environment isn't on.
To unset current custom environment pass in null. Setting to a valid environment will also
turn the environment for this specific usage on.

Rhino.Render.CurrentEnvironmentImpl.ForReflectionAndRefraction
Get or set the RenderEnvironment used as custom reflection and refraction environment.
Null will be returned if the custom environment isn't on.
To unset current custom environment pass in null. Setting to a valid environment will also
turn the environment for this specific usage on.

Rhino.Render.CurrentEnvironmentImpl.ForAnyUsage
Set given RenderEnvironment for all usage forms (background/360deg, custom reflection and refraction,
custom skylight).
Give null to disable all environments

Rhino.Render.CurrentEnvironmentImpl.On(Rhino.Render.RenderEnvironment.Usage)
Check if given environment is enabled

Rhino.Render.CurrentEnvironmentImpl.SetOn(Rhino.Render.RenderEnvironment.Usage,System.Boolean)
Set given environment on/off