Rhino.Geometry.Arc.StartAngleDegrees
Gets or sets the start angle (in Radians) for this arc segment.
Since: 5.0

Rhino.Geometry.Arc.EndAngleDegrees
Gets or sets the end angle (in Radians) for this arc segment.
Since: 5.0

Rhino.Geometry.Arc.AngleDegrees
Gets or sets the sweep -or subtended- angle (in Radians) for this arc segment.
Since: 5.0

Rhino.Geometry.Arc.Trim(Rhino.Geometry.Interval)
Sets arc's angle domain (in radians) as a sub-domain of the circle.
domain:
0 < domain[1] - domain[0] <= 2.0 * RhinoMath.Pi.
Returns: true on success, false on failure.
Since: 5.0