Rhino.UI.Panels.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)
You typically register your panel class in your plug-in's OnLoad
function.  This will register your custom call with Rhino, Rhino will
create an instance of your class the first time your panel is created
and embed this instance of your class in a panel container.
plugin: Plug-in this panel is associated with
panelType:
Class type to construct when a panel is shown.  If your class is
derived from Eto.Forms.Control it will work on both the Mac and
Windows version of Rhino.  In addition Windows Rhino will support any
class types that implement the IWin32Window interface or that are
derived from System.Windows.FrameworkElement.  Mac Rhino will also
support classes that are derived from NsView.  In addition to the
type requirements the class must have a public constructor with no
parameters or a constructor with a single uint that represents the
document serial number and have a GuidAttribute applied with a
unique Id.  n Windows there is only one panel created which gets
recycled for each new document.  On the Mac a panel will be created
for each open document and destroyed when the document closes.  In
certain situations in Mac Rhino a a panel may get created and
destroyed multiple times when opening/closing a panel while editing a
document.
caption:
Displays in the panel tab on Windows or at the top of the modeless
window on Mac.
icon:
Currently only used in Windows, use a 32bit depth icon in order to
get proper transparency.
Since: 5.0

Rhino.UI.Panels.PanelDockBar(System.Guid)
Will always return Guid.Emty in Mac Rhino.  In Windows Rhino it will
look for the dock bar which contains the specified panel class Id and
return the dock bar Id.
panelId:
Panel class Id for of the panel to look for.
Returns:
Always returns Guid.Empty on Mac Rhino.  On Windows Rhino it will
return the Id for the dock bar which host the specified panel or
Guid.Empty if the panel is not currently visible.
Since: 5.12

Rhino.UI.Panels.PanelDockBar(System.Type)
Will always return Guid.Emty in Mac Rhino.  In Windows Rhino it will
look for the dock bar which contains the specified panel class Id and
return the dock bar Id.
panelType:
Panel class for of the panel to look for.
Returns:
Always returns Guid.Empty on Mac Rhino.  On Windows Rhino it will
return the Id for the dock bar which host the specified panel or
Guid.Empty if the panel is not currently visible.
Since: 5.12