Rhino.Render.ContentUndoHelper.#ctor(Rhino.RhinoDoc,System.String)
Constructs a ContentUndoHelper object inside a using block to handle undo when modifying a RenderContent
or - alternatively - create the ContentUndoHelper and explicitly call Dispose when you are done.
doc:
description: Undo description (which appears in the UI when undo is run)
Since: 6.0