Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)
Constructor for SceneServerData
Since: 6.0

Rhino.Render.SceneServerData.Dispose(System.Boolean)
Dispose for PreivewLighting