Rhino.UI.ObjectPropertiesPage.AllObjectsMustBeSupported
Returns true when running on Mac which requires only objects of
SupportedTypes.  Returns false when running on Windows which only
requires a single item of SupportedTypes to be selected.
Override if you wish to change the above behavior.
Since: 6.7