Rhino.Runtime.InteropWrappers.StdVectorByte.ConstPointer
Gets the constant (immutable) pointer of this vector.
Returns: The constant pointer.

Rhino.Runtime.InteropWrappers.StdVectorByte.NonConstPointer
Gets the non-constant pointer (for modification) of this vector.
Returns: The non-constant pointer.

Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte class.

Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor(Rhino.Runtime.InteropWrappers.StdVectorByte)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte with the contents of another SimpleArrayByte.

Rhino.Runtime.InteropWrappers.StdVectorByte.CopyTo(Rhino.Runtime.InteropWrappers.StdVectorByte)
Copies the contents of a Rhino.Runtime.InteropWrappers.StdVectorByte into another StdVectorByte.

Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor(System.Collections.Generic.IEnumerable{System.Byte})
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorByte class
values: initial set of integers to add to the array

Rhino.Runtime.InteropWrappers.StdVectorByte.Count
Gets the amount of elements in this array.

Rhino.Runtime.InteropWrappers.StdVectorByte.Memory
Return the raw data.

Rhino.Runtime.InteropWrappers.StdVectorByte.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.