Rhino.Geometry.Triangle3d.Perimeter
Gets the perimeter of this triangle. This is the sum of the lenghts of all edges.
Since: 7.1

Rhino.Geometry.Triangle3d.PointAtBarycentricCoords(Rhino.Geometry.Point2d)
Gets a point within this triangle using barycentric coordinates.
coords: Barycentic mass for vertex B and C. A is valued as (1 - B - C).
Returns: Point at barycentric mass.
Since: 7.1