Rhino.UI.PanelContainers.FindOrCreateInstance(System.Guid,Rhino.UI.PanelDefinition,System.UInt32)
Check for the container specific instance of a panel and if not then
create one.
containerId:
The container Id associated with the Rhino.UI.PanelInstance
definition:
The Rhino.UI.PanelDefinition containing the creation information
needed to create the panel.
documentSerailNumber:
The document runtime serial number which will be optionally passed to
the panel class constructor.
Returns:
Returns the Rhino.UI.PanelInstance associated with a container of
null if there was a problem creating one.