Rhino.Render.PostEffects.PostEffect.ReadFromDocumentDefaults(Rhino.RhinoDoc)
Read the state from document defaults. This is implemented by RDK to call ReadState()
so usually a post effect only has to implement ReadState(). However, a post effect can override this
method to take complete control of how the document defaults are read.
doc: Rhino document
Returns: Return true if read was succesfull
Since: 7.0

Rhino.Render.PostEffects.PostEffect.WriteToDocumentDefaults(Rhino.RhinoDoc)
Write the state to document defaults. This is implemented by RDK to call WriteState()
so usually a post effect only has to implement WriteState(). However, a post effect can override this
method to take complete control of how the document defaults are written.
doc: Rhino document
Returns: Return true if write was succesful
Since: 7.0