Rhino.Render.FreeFloatingBase
Base class for Rhino.Render objects that are owned by the document, or can be delivered separately
from other functions.  In general, you cannot create these objects yourself.
'