Rhino.DocObjects.Font.FontOrigin
Platform where font originated. This information is useful when
searching for appropriate substitues.

Rhino.DocObjects.Font.FontOrigin.Unknown
Origin unknown. Changing an ON_Font characteristic like weight or sytle sets the origin to unknown.