Rhino.UnitSystem.None
ON::LengthUnitSystem::None indicates no length unit system. The scale factor
when converting between a specified unit system and None is always 1.0.
ON::LengthUnitSystem::None is used as a unit system for models and
instance defitions that should be imported or referenced with no
scaling applied.

Rhino.UnitSystem.Unset
The ON::LengthUnitSystem::Unset is used to indicate no unit system is set.
This is a differnt condition from ON::LengthUnitSystem::None.