Rhino.Geometry.SubDEdge.ToNurbsCurve(System.Boolean)
Get a cubic, uniform, non-rational, NURBS curve that is on the
edge's limit curve.
clampEnds:
If true, the end knots are clamped.
Otherwise the end knots are(-2,-1,0,...., k1, k1+1, k1+2).
Returns:
Since: 7.0