Rhino.Geometry.AreaMassProperties.WorldCoordinatesPrincipalMomentsOfInertia(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments of inertia and principal axes with repect to world coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.3

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the eigenvalues and eigenvectors of the moments matrix with repect to centroid coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 6.9

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesPrincipalMomentsOfInertia(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments of inertia and principal axes with repect to centroid coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.3