Rhino.Render.TextureEvaluator.WriteToByteArray(System.Int32,System.Int32)
Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see
if the data can be extracted direct to a width*height*4 array of unsigned chars.
width: is the point for which to evaluate the texture.
height: duvwdx is a ray differential.
Returns: A ByteArray full of the byte values in RGBA order, or null if the function did not succeed
Since: 7.0

Rhino.Render.TextureEvaluator.WriteToFloatArray(System.Int32,System.Int32)
Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see
if the data can be extracted direct to a width*height*4 array of unsigned chars.
width: is the point for which to evaluate the texture.
height: duvwdx is a ray differential.
Returns: A FloatArray full of the float values in RGBA order, or null if the function did not succeed.
Since: 7.0