Rhino.DocObjects.RhinoObject.GetRenderMeshes(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Boolean,System.Boolean)
Gets the render meshes of some objects.
rhinoObjects: An array, a list, or any enumerable set of Rhino objects.
okToCreate: true if the method is allowed to instantiate new meshes if they do not exist.
returnAllObjects: true if all objects should be returned.
Returns: An array of object references.
Since: 5.0

Rhino.DocObjects.RhinoObject.GetRenderMeshesWithUpdatedTCs(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Gets the render meshes of some objects.
rhinoObjects: An array, a list, or any enumerable set of Rhino objects.
okToCreate: true if the method is allowed to instantiate new meshes if they do not exist.
returnAllObjects: true if all objects should be returned.
skipHiddenObjects: true if if hidden objects should be ignored.
updateMeshTCs: true if the TCs should be updated with a texture mapping.
Returns: An array of object references.
Since: 7.3

Rhino.DocObjects.RhinoObject.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Determines if custom render meshes will be built for a particular object.
viewport: The viewport being rendered.
attrs:
Type of mesh to build. If attributes is non-null then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this object.
Since: 6.0

Rhino.DocObjects.RhinoObject.GetRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Build custom render mesh(es) for this object.
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
Returns:
Returns a RenderPrimitiveList if successful otherwise returns null.
Since: 6.0

Rhino.DocObjects.RhinoObject.TryGetRenderPrimitiveBoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes,Rhino.Geometry.BoundingBox@)
Get the bounding box for the custom render meshes associated with this
object.
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
boundingBox:
This will be set to BoundingBox.Unset on failure otherwise it will be
the bounding box for the custom render meshes associated with this
object.
Returns:
Returns true if the bounding box was successfully calculated otherwise
returns false on error.
Since: 6.0