Rhino.DocObjects.Tables.HatchPatternTable.Find(System.String,System.Boolean)
Finds the hatch pattern with a given name. Search ignores case.
name: The name of the hatch patter to be found.
ignoreDeleted: true means don't search deleted hatch patterns.
Returns: Index of the hatch pattern with the given name. -1 if no hatch pattern found.
Since: 5.0
6.0

Rhino.DocObjects.Tables.HatchPatternTable.FindName(System.String)
Finds the hatch pattern with a given name. Search ignores case.
name: The name of the hatch patter to be found.
Returns: Hatch pattern with the given name. Null if no hatch pattern found.
Since: 6.0

Rhino.DocObjects.Tables.HatchPatternTable.Add(Rhino.DocObjects.HatchPattern)
Adds a new hatch pattern with specified definition to the table.
pattern:
definition of new hatch pattern. The information in pattern is copied.
If patern.Name is empty the a unique name of the form "HatchPattern 01"
will be automatically created.
Returns:
>=0 index of new hatch pattern
-1  not added because a hatch pattern with that name already exists or
some other problem occurred.
Since: 5.0