Rhino.Display.ViewCaptureSettings
Holds the information required to generate high resolution output of a
RhinoViewport.  This is used for generating paper prints or image files

Rhino.Display.ViewCaptureSettings.#ctor
Constructor
Since: 6.0