Rhino.Render.Variant.#ctor
Constructs as VariantTypes.Null.

Rhino.Render.Variant.AsModelFloat(Rhino.RhinoDoc)
Retrieves the value as a float in model units. Null or varying returns 0.0.
The value will be converted from the variant's units to model units if necessary.
\see Units(). \see SetUnits().
document: A Rhino document.
Returns: The value in model units.
This is a single-precision value.

Rhino.Render.Variant.AsModelDouble(Rhino.RhinoDoc)
Retrieves the value as a double in model units. Null or varying returns 0.0.
The value will be converted from the variant's units to model units if necessary.
\see Units(). \see SetUnits().
document: A Rhino document.
Returns: The value in model units.
This is a double-precision value.

Rhino.Render.Variant.SetAsModelFloat(System.Single,Rhino.RhinoDoc)
Sets the value to a float in model units.
The value will be converted from model units to the variant's units if necessary.
f: The value in model units.
document: A Rhino document.

Rhino.Render.Variant.SetAsModelDouble(System.Double,Rhino.RhinoDoc)
Sets the value to a double in model units.
The value will be converted from model units to the variant's units if necessary.
d: The value in model units.
document: A Rhino document.