Rhino.Render.RenderPanels.RegisterPanel(Rhino.PlugIns.PlugIn,Rhino.Render.RenderPanelType,System.Type,System.Guid,System.String,System.Boolean,System.Boolean)
Register custom render user interface with Rhino.  This should only be
done in Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels).  Panels
registered after Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels) is called
will be ignored.
plugin:
The plug-in providing the custom user interface
renderPanelType:
See Rhino.Render.RenderPanelType for supported user interface types.
panelType:
The type of object to be created and added to the render container.
renderEngineId:
The render engine id allowing the UI to be shown
caption:
The caption for the custom user interface.
alwaysShow:
If true the custom user interface will always be visible, if false then
it may be hidden or shown as requested by the user.
initialShow:
Initial visibility state of the custom user interface control.
Since: 7.0