Rhino.Runtime.Analytics
Provides tools for sending Google Analytics events using the Measurement Protocol. See https://developers.google.com/analytics/devguides/collection/protocol/v1/devguide#event for details.

Rhino.Runtime.Analytics.#ctor(System.String,System.String)
Construct Analytics class
TrackingID: Google Analytics Tracking ID
Name: Name of Application. For example, "Ocelot". Do not include version numbers. Maps to Google Analytics parameter 'an'
Since: 6.0