Rhino.Geometry.Mesh.CreateFromSubD(Rhino.Geometry.SubD,System.Int32)
Create a mesh from a SubD limit surface
subd:
displayDensity:
Returns:
Since: 7.0

Rhino.Geometry.Mesh.CreatePatch(Rhino.Geometry.Polyline,System.Double,Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,System.Int32)
Construct a mesh patch from a variety of input geometry.
outerBoundary: (optional: can be null) Outer boundary
polyline, if provided this will become the outer boundary of the
resulting mesh. Any of the input that is completely outside the outer
boundary will be ignored and have no impact on the result. If any of
the input intersects the outer boundary the result will be
unpredictable and is likely to not include the entire outer boundary.
angleToleranceRadians:
Maximum angle between unit tangents and adjacent vertices. Used to
divide curve inputs that cannot otherwise be represented as a polyline.
innerBoundaryCurves:
(optional: can be null) Polylines to create holes in the output mesh.
If innerBoundaryCurves are the only input then the result may be null
if trimback is set to false (see comments for trimback) because the
resulting mesh could be invalid (all faces created contained vertexes
from the perimeter boundary).
pullbackSurface:
(optional: can be null) Initial surface where 3d input will be pulled
to make a 2d representation used by the function that generates the mesh.
Providing a pullbackSurface can be helpful when it is similar in shape
to the pattern of the input, the pulled 2d points will be a better
representation of the 3d points. If all of the input is more or less
coplanar to start with, providing pullbackSurface has no real benefit.
innerBothSideCurves:
(optional: can be null) These polylines will create faces on both sides
of the edge. If there are only input points(innerPoints) there is no
way to guarantee a triangulation that will create an edge between two
particular points. Adding a line, or polyline, to innerBothsideCurves
that includes points from innerPoints will help guide the triangulation.
innerPoints:
(optional: can be null) Points to be used to generate the mesh. If
outerBoundary is not null, points outside of that boundary after it has
been pulled to pullbackSurface (or the best plane through the input if
pullbackSurface is null) will be ignored.
trimback:
Only used when a outerBoundary has not been provided. When that is the
case, the function uses the perimeter of the surface as the outer boundary
instead. If true, any face of the resulting triangulated mesh that
contains a vertex of the perimeter boundary will be removed.
divisions:
Only used when a outerBoundary has not been provided. When that is the
case, division becomes the number of divisions each side of the surface's
perimeter will be divided into to create an outer boundary to work with.
Returns: mesh on success; null on failure
Since: 6.0

Rhino.Geometry.Mesh.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Computes the solid union of a set of meshes.
meshes: Meshes to union.
Returns: An array of Mesh results or null on failure.
Since: 5.0

Rhino.Geometry.Mesh.CreateFromCurveExtrusion(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,Rhino.Geometry.MeshingParameters,Rhino.Geometry.BoundingBox)
Constructs a mesh from an extruded curve.
curve: A curve to extrude.
direction: The direction of extrusion.
parameters: The parameters of meshing.
boundingBox: The bounding box controls the length of the extrusion.
Returns: A new mesh, or null on failure.
Remarks:
This method is designed to be used when projecting curves onto a mesh. In general,
a better solution is to use extrude the curve into a surface using Rhino.Geometry.Surface.CreateExtrusion(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d),
and then create a mesh from the surface using Rhino.Geometry.Mesh.CreateFromSurface(Rhino.Geometry.Surface). The Rhino.Geometry.Extrusion and
Rhino.Geometry.SumSurface classes can also be used to create extrusions.
Since: 7.0

Rhino.Geometry.Mesh.Unweld(System.Double,System.Boolean)
Makes sure that faces sharing an edge and having a difference of normal greater
than or equal to angleToleranceRadians have unique vertexes along that edge,
adding vertices if necessary.
angleToleranceRadians: Angle at which to make unique vertices.
modifyNormals:
Determines whether new vertex normals will have the same vertex normal as the original (false)
or vertex normals made from the corresponding face normals (true)
Since: 5.0

Rhino.Geometry.Mesh.Weld(System.Double)
Makes sure that faces sharing an edge and having a difference of normal greater
than or equal to angleToleranceRadians share vertexes along that edge, vertex normals
are averaged.
angleToleranceRadians: Angle at which to weld vertices.
Since: 5.0

Rhino.Geometry.Mesh.HealNakedEdges(System.Double)
Attempts to "heal" naked edges in a mesh based on a given distance.
First attempts to move vertexes to neighboring vertexes that are within that
distance away. Then it finds edges that have a closest point to the vertex within
the distance and splits the edge. When it finds one it splits the edge and
makes two new edges using that point.
distance: Distance to not exceed when modifying the mesh.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Mesh.ExplodeAtUnweldedEdges
Explode the mesh into sub-meshes where a sub-mesh is a collection of faces that are contained
within a closed loop of "unwelded" edges. Unwelded edges are edges where the faces that share
the edge have unique mesh vertexes (not mesh topology vertexes) at both ends of the edge.
Returns:
Array of sub-meshes on success; null on error. If the count in the returned array is 1, then
nothing happened and the output is essentially a copy of the input.
Since: 5.0