Rhino.Geometry.Light.CreateSunLight(System.Double,System.DateTime,System.Double,System.Double)
Constructs a light which simulates the Sun based on a given time and location on Earth.
northAngleDegrees: The angle of North in degrees. North is the angle between positive World Y axis and model North, as measured on World XY plane.
when: The time of the measurement. The Kind property of DateTime specifies whether this is in local or universal time.
Local and Undefined daytime kinds in this argument are considered local.
latitudeDegrees: The latitude, in degrees, of the location on Earth.
longitudeDegrees: The longitude, in degrees, of the location on Earth.
Returns: A newly constructed light object.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.
Since: 5.0