Rhino.ApplicationSettings.AppearanceSettings.SetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Drawing.Color)
Sets the logical paint color association to a spacific .Net library color, without forced UI update.
whichColor: A logical color association.
c: A .Net library color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.SetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Drawing.Color,System.Boolean)
Sets the logical paint color association to a spacific .Net library color.
whichColor: A logical color association.
c: A .Net library color.
forceUiUpdate: true if the UI should be forced to update.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.SetWidgetColor(Rhino.ApplicationSettings.WidgetColor,System.Drawing.Color)
Sets the logical widget color association to a spacific .Net library color, without forced UI update.
whichColor: A logical color association.
c: A .Net library color.
Since: 6.0

Rhino.ApplicationSettings.AppearanceSettings.SetWidgetColor(Rhino.ApplicationSettings.WidgetColor,System.Drawing.Color,System.Boolean)
Sets the logical widget color association to a spacific .Net library color.
whichColor: A logical color association.
c: A .Net library color.
forceUiUpdate: true if the UI should be forced to update.
Since: 6.0