Rhino.Render.RenderContentSerializer.ReportContentAndFile(Rhino.Render.RenderContent,System.String,System.Int32)
This is called from your implementation of LoadMultiple() to add a content and the file it was loaded from
when the LoadMultipleFlags.Preload flag is NOT set.
See LoadMultiple() for an explanation of this method's use.
renderContent:
Render content that was loaded from the file.
pathToFile:
Full path of the file that the render content was loaded from.
flags:
Flags for future use; should be passed as zero.
Since: 7.0

Rhino.Render.RenderContentSerializer.ReportDeferredContentAndFile(Rhino.Render.RenderContent,System.String,System.Int32)
This is called from your implementation of LoadMultiple() to add a 'deferred' content and the file it will be loaded from,
when the LoadMultipleFlags.Preload flag is set.
See LoadMultiple() for an explanation of this method's use.
\param c is the deferred content.
\param wszFullPath is the full path to the file that 'c' will be loaded from.
\param flags is reserved for future use; you should pass zero.
\param pReserved is reserved for future use; you should pass nullptr. */
renderContent:
Deferred render content - represents all contents that will be loaded from the file.
pathToFile:
Full path of the file that render contents will be loaded from.
flags:
Flags for future use; should be passed as zero.
Since: 7.0