Rhino.Render.Decals.#ctor(System.IntPtr)
Constructor to create read-only access Decals. The iterator is not
owned so cannot be disposed.
Since: 7.0

Rhino.Render.Decals.Clear
Since: 5.10

Rhino.Render.Decals.Remove(Rhino.Render.Decal)
Since: 5.10