Rhino.DocObjects.Tables.GroupTable.GroupNames(System.Boolean)
Returns an array of all group names.
ignoreDeletedGroups: Ignore any groups that were deleted.
Returns: An array if group names if succesful, null if there are no groups.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.GroupObjectCount(System.Int32)
Returns the number of objects that are members of a group.
groupIndex: The index of the group.
Returns: The nnumber of objects that are members of the group.
Since: 5.0