Rhino.UI.Controls.IHeaderButtonHandler.ButtonDetails(System.Int32,System.Drawing.Bitmap@,System.String@)
Since: 7.4

Rhino.UI.Controls.IHeaderButtonHandler.OnButtonClicked(System.Int32)
Since: 7.4

Rhino.UI.Controls.IHeaderButtonHandler.ButtonRect(System.Int32,System.Drawing.Rectangle)
Since: 7.4